system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
c| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         50;

deltaT          0.001;

writeControl    adjustableRunTime; //adjustableRunTime;

writeInterval   0.5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   7;

runTimeModifiable off;

adjustTimeStep  off; //off, no

maxCo           2;
maxAlphaCo      2;
maxDeltaT       2;
wallShearStress1
{
    // Mandatory entries (unmodifiable)
    type        wallShearStress;
    libs        (fieldFunctionObjects);

    // Optional entries (runtime modifiable)
    patches     ("concretewall" "pipe2" "alcantarillado" "disipador");   
    // Optional (inherited) entries
}
};


// ************************************************************************* //
