constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        inGroups        List<word> 1(wall);
        nFaces          1354;
        startFace       1558832;
    }
    outlet
    {
        type            patch;
        inGroups        List<word> 1(wall);
        nFaces          2600;
        startFace       1560186;
    }
    wall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          250558;
        startFace       1562786;
    }
    atmosphere
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          43324;
        startFace       1813344;
    }
)

// ************************************************************************* //
